# pandas

In [6]:
import pandas as pd
iris = pd.read_csv("/Users/kyungeunjeon/Downloads/iris.csv")

In [8]:
iris
print(type(iris))

<class 'pandas.core.frame.DataFrame'>

In [11]:
# fancy version of ndarray = series
pd.Series([1,2,3,4])
pd.Series(range(5))

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [13]:
s=pd.Series([4,2,1,3])
s

0    4
1    2
2    1
3    3
dtype: int64

In [15]:
#series can make array() and index()
s.array 
s.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
# Numpy for vectorized operation : mix numpy and series's index
import numpy as np
t = pd.Series([4,2,1,3],index=["a","b","c","d"])

In [17]:
t

a    4
b    2
c    1
d    3
dtype: int64

In [20]:
np.log(t)

a    1.386294
b    0.693147
c    0.000000
d    1.098612
dtype: float64

In [25]:
# Series indexing
t[1]
t[[1,2]]
t["c"] #search with just index
t[t==3]
t[t%2==0]

a    4
b    2
dtype: int64

In [27]:
m = pd.Series([1,2,3,4], index = ["a","b","c","d"])
n = pd.Series([4,3,2,1], index = ["d","c","b","a"])
o = pd.Series([1,1,1,1,1], index = ["b","d","a","c","e"])

In [28]:
m

a    1
b    2
c    3
d    4
dtype: int64

In [29]:
n

d    4
c    3
b    2
a    1
dtype: int64

In [30]:
m+n #same with n+m

a    2
b    4
c    6
d    8
dtype: int64

In [31]:
n+m

a    2
b    4
c    6
d    8
dtype: int64

In [33]:
o

b    1
d    1
a    1
c    1
e    1
dtype: int64

In [32]:
n+o #not number nan (there is no value in n with e variable => NaN)
# But a weired thing is Nan is float64
# You need to take care of Missing values

a    2.0
b    3.0
c    4.0
d    5.0
e    NaN
dtype: float64

In [34]:
d = {"anna": "A+", "bob": "B-", "carol": "C", "dave": "D+"}
pd.Series(d)

In [35]:
d # just ':' means dictionaries

{'anna': 'A', 'bob': 'B+', 'carol': 'C', 'dave': 'D'}

In [36]:
pd.Series(d)

anna      A
bob      B+
carol     C
dave      D
dtype: object

In [37]:
pd.Series(d, index=["dave","carol","bob","anna"]) #reorder with index

dave      D
carol     C
bob      B+
anna      A
dtype: object

In [40]:
s = pd.Series(
  {"anna": "A+", "bob": "B-", "carol": "C", "dave": "D+"}, 
  index = ["erin","dave","carol","bob","anna"]
)

In [41]:
pd.isna(s) # find the missing values
# nan is not nan so cannot test for it

erin      True
dave     False
carol    False
bob      False
anna     False
dtype: bool

In [42]:
s = pd.Series(
  {"anna": "A+", "bob": "B-", "carol": "C", "dave": "D+"}, 
  index = ["erin","dave","carol","bob","anna"]
)

In [43]:
s # You can check Nan or NA with isna()

erin     NaN
dave      D+
carol      C
bob       B-
anna      A+
dtype: object

In [ ]:
pd.isna(s)

erin      True
dave     False
carol    False
bob      False
anna     False
dtype: bool

In [45]:
np.nan == np.nan

False

In [46]:
pd.isna(pd.Series([1,2,3,None]))

0    False
1    False
2    False
3     True
dtype: bool

In [47]:
pd.isna(pd.Series([1,2,3,np.nan]))

0    False
1    False
2    False
3     True
dtype: bool

In [49]:
pd.isna(pd.Series([True, False, None]))

0    False
1    False
2     True
dtype: bool

In [51]:
# text string series
s = pd.Series(["the quick","brown fox","jumps"])
s

0    the quick
1    brown fox
2        jumps
dtype: object

In [52]:
s.str.upper()

0    THE QUICK
1    BROWN FOX
2        JUMPS
dtype: object

In [53]:
"Hello workd".upper()

'HELLO WORKD'

In [54]:
s.str.split(" ")

0    [the, quick]
1    [brown, fox]
2         [jumps]
dtype: object

In [59]:
# categroical series
pd.Series(["Mon","Tue","Wed"],
         dtype=pd.CategoricalDtype(
             categories=["Mon","Tue","Wed","Thu","Fri"],
             ordered=True)
         )

0    Mon
1    Tue
2    Wed
dtype: category
Categories (5, object): ['Mon' < 'Tue' < 'Wed' < 'Thu' < 'Fri']

In [63]:
pd.Series(["Mon","Tue","Wed"],
         dtype="category")

0    Mon
1    Tue
2    Wed
dtype: category
Categories (3, object): ['Mon', 'Tue', 'Wed']

In [67]:
# Create dataframes
n = 5
d = {
"id" : np.random.randint(100,999,n),
"weight": np.random.normal(70,20,n)}
d
df=pd.DataFrame(d)
df

    id     weight
0  193  99.897134
1  419  83.883972
2  708  75.201062
3  984  52.847680
4  673  65.292350

In [71]:
pd.DataFrame(
np.diag([1,2,3]),
columns = ["x","y","z"],
index = ["a","b","c"])

   x  y  z
a  1  0  0
b  0  2  0
c  0  0  3

In [72]:
# data frame indexing
df

    id     weight
0  193  99.897134
1  419  83.883972
2  708  75.201062
3  984  52.847680
4  673  65.292350

In [74]:
df["id"]

0    193
1    419
2    708
3    984
4    673
Name: id, dtype: int64

In [75]:
df.iloc[1]

id        419.000000
weight     83.883972
Name: 1, dtype: float64

In [76]:
df.loc[1]

id        419.000000
weight     83.883972
Name: 1, dtype: float64

In [78]:
df2 = df.copy()
df2

    id     weight
0  193  99.897134
1  419  83.883972
2  708  75.201062
3  984  52.847680
4  673  65.292350

In [80]:
df2.index = (["anna","bob","carol","dave","erin"])
df2

        id     weight
anna   193  99.897134
bob    419  83.883972
carol  708  75.201062
dave   984  52.847680
erin   673  65.292350

In [81]:
df2.loc[:,"weight"] #weight is list

anna     99.897134
bob      83.883972
carol    75.201062
dave     52.847680
erin     65.292350
Name: weight, dtype: float64

In [82]:
df2.loc[df2.id<300]

       id     weight
anna  193  99.897134

In [85]:
# views vs. copies : pandas always create the copied version
d = pd.DataFrame(np.arange(6).reshape(3,2), columns=["x","y"])
d

   x  y
0  0  1
1  2  3
2  4  5

In [86]:
v = d.iloc[0:2,0:2]
v

   x  y
0  0  1
1  2  3

In [87]:
v.iloc[0,1]=-1
print(v)
print(d) #copy but same.. syncronized

   x  y
0  0 -1
1  2  3
   x  y
0  0 -1
1  2  3
2  4  5

In [98]:
iris.query('SepalLengthCm > 5.1')

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
5,6,5.4,3.9,1.7,0.4,Iris-setosa
10,11,5.4,3.7,1.5,0.2,Iris-setosa
14,15,5.8,4.0,1.2,0.2,Iris-setosa
15,16,5.7,4.4,1.5,0.4,Iris-setosa
16,17,5.4,3.9,1.3,0.4,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [99]:
df

    id     weight
0  193  99.897134
1  419  83.883972
2  708  75.201062
3  984  52.847680
4  673  65.292350

In [100]:
df.size

10

In [102]:
# 4 different ways to merge data : https://blog.naver.com/koeun0811/222671392480
northeast = pd.Series(['CT','ME','MA','NH','RI','VT','NJ','NY','PA'])
south = pd.Series(['DE','FL','GA','MD','NC','SC','VA','DC','WV','AL','KY','MS','TN','AR','LA','OK','TX'])
midwest = pd.Series(['IL','IN','MN','MO','NE','ND','SD','IA','KS','MI','OH','WI'])
west = pd.Series(['AZ','CO','ID','MT','NV','NM','UT','WY','AK','CA','HI','OR','WA'])

In [104]:
new_east_test = northeast.append(south)
new_east = northeast.append(south).reset_index(drop=True)
print(new_east_test) 
print(new_east) #indexing newly

0     CT
1     ME
2     MA
3     NH
4     RI
5     VT
6     NJ
7     NY
8     PA
0     DE
1     FL
2     GA
3     MD
4     NC
5     SC
6     VA
7     DC
8     WV
9     AL
10    KY
11    MS
12    TN
13    AR
14    LA
15    OK
16    TX
dtype: object
0     CT
1     ME
2     MA
3     NH
4     RI
5     VT
6     NJ
7     NY
8     PA
9     DE
10    FL
11    GA
12    MD
13    NC
14    SC
15    VA
16    DC
17    WV
18    AL
19    KY
20    MS
21    TN
22    AR
23    LA
24    OK
25    TX
dtype: object

/var/folders/0m/966_8tjn5pddy9gxt6rqdwh00000gn/T/ipykernel_1249/3455082987.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_east_test = northeast.append(south)
/var/folders/0m/966_8tjn5pddy9gxt6rqdwh00000gn/T/ipykernel_1249/3455082987.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_east = northeast.append(south).reset_index(drop=True)

In [ ]:
# a.append(b)
# pd.concat([a,b])
# a.join(b)
# pd.merge([a,b])

In [109]:
# df.groupby("student").agg("mean")
# df.groupby("student").agg([np.mean, np.std])
# df.groupby("student").agg([np.mean, np.std]).columns

NameError: name 'east' is not defined